/**/

parse upper arg window type

i = 1
j = 1
new_id = 1000
object. = ''

/* Get index of first item  Container */
index=VpGetIndex(window,1000,'NEXT',0)

do while index <> 0
  /* Get item columns at index  Container */
  /* COLUMNS.0 - count */
  /* COLUMNS.n - nth columns */
  CALL VpGetItemValue window,1000,'DETAILS','COLUMNS.',index
  if columns.2 = type then
  do
    object.i = columns.1
    i = i + 1
  end
  /* Get index of next item  Container */
  index=VpGetIndex(window,1000,'NEXT',index)
end

do j = 1 to i by 1
  if object.j = new_id then
  do
    new_id = new_id + 1
    j = 1
  end
end

return new_id
